esrille/new-keyboard/firmware/third_party/mla_v2013_12_20/apps/usb/device/bootloaders/firmware/pic18_non_j/src/BootPIC18NonJ.c
#elif defined(__18F4455)||defined(__18F2455)
    #define MAX_PAGE_TO_ERASE           383      //Last 64 byte page of flash on the PIC18F4455
    #define PROGRAM_MEM_STOP_ADDRESS    0x006000 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If PROGRAM_MEM_STOP_ADDRESS = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**
    #define CONFIG_WORDS_START_ADDRESS  0x300000 /0x300000 is start of CONFIG space for these devices
    #define CONFIG_WORDS_SECTION_LENGTH 14       //14 bytes worth of Configuration words on these devices
    #define USER_ID_ADDRESS             0x200000 //User ID is 8 bytes starting at 0x200000
    #define USER_ID_SIZE                8
    #define DEVICE_WITH_EEPROM                   //Comment this out, if you never want the bootloader to reprogram the EEPROM space
    #define EEPROM_SIZE                 0x100    //256 bytes of EEPROM on this device
    #define EEPROM_EFFECTIVE_ADDRESS    0xF00000 //Location in the .hex file where the EEPROM contents are stored
    #define WRITE_BLOCK_SIZE            0x20     //32 byte programming block size on the PIC18F4550/PIC18F4553 family devices
    #define ERASE_PAGE_SIZE             64

#elif defined(__18F4458)||defined(__18F2458)
    #define MAX_PAGE_TO_ERASE           383      //Last 64 byte page of flash on the PIC18F4455
    #define PROGRAM_MEM_STOP_ADDRESS    0x006000 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If PROGRAM_MEM_STOP_ADDRESS = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**
    #define CONFIG_WORDS_START_ADDRESS  0x300000 /0x300000 is start of CONFIG space for these devices
    #define CONFIG_WORDS_SECTION_LENGTH 14       //14 bytes worth of Configuration words on these devices
    #define USER_ID_ADDRESS             0x200000 //User ID is 8 bytes starting at 0x200000
    #define UserIDSize                  8
    #define DEVICE_WITH_EEPROM                   //Comment this out, if you never want the bootloader to reprogram the EEPROM space
    #define EEPROM_SIZE                 0x100    //256 bytes of EEPROM on this device
    #define EEPROM_EFFECTIVE_ADDRESS    0xF00000 //Location in the .hex file where the EEPROM contents are stored
    #define WRITE_BLOCK_SIZE            0x20     //32 byte programming block size on the PIC18F4550/PIC18F4553 family devices
    #define ERASE_PAGE_SIZE             64

#elif defined(__18F4450)||defined(__18F2450)
    #define MAX_PAGE_TO_ERASE           255      //Last 64 byte page of flash on the PIC18F4450
    #define PROGRAM_MEM_STOP_ADDRESS    0x004000 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If PROGRAM_MEM_STOP_ADDRESS = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**
    #define CONFIG_WORDS_START_ADDRESS  0x300000 /0x300000 is start of CONFIG space for these devices
    #define CONFIG_WORDS_SECTION_LENGTH 14       //14 bytes worth of Configuration words on these devices
    #define USER_ID_ADDRESS             0x200000 //User ID is 8 bytes starting at 0x200000
    #define USER_ID_SIZE                8
    #define WRITE_BLOCK_SIZE            0x10     //16 byte programming block size on the PIC18F4450/2450 family devices
    #define ERASE_PAGE_SIZE             64

#elif defined(__18F24K50)||defined(__18LF24K50) 
    #define MAX_PAGE_TO_ERASE           255      //Last 64 byte page of flash on the PIC18F4450
    #define PROGRAM_MEM_STOP_ADDRESS    0x004000 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If PROGRAM_MEM_STOP_ADDRESS = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**
    #define CONFIG_WORDS_START_ADDRESS  0x300000 /0x300000 is start of CONFIG space for these devices
    #define CONFIG_WORDS_SECTION_LENGTH 14       //14 bytes worth of Configuration words on these devices
    #define USER_ID_ADDRESS             0x200000 //User ID is 8 bytes starting at 0x200000
    #define USER_ID_SIZE                8
    #define DEVICE_WITH_EEPROM                   //Comment this out, if you never want the bootloader to reprogram the EEPROM space
    #define EEPROM_SIZE                 0x100    //256 bytes of EEPROM on this device
    #define EEPROM_EFFECTIVE_ADDRESS    0xF00000 //Location in the .hex file where the EEPROM contents are stored
    #define WRITE_BLOCK_SIZE            0x10     //16 byte programming block size on the PIC18F4450/2450 family devices
    #define ERASE_PAGE_SIZE             64

#elif defined(__18F14K50) || defined(__18LF14K50)
    #define MAX_PAGE_TO_ERASE           255      //Last 64 byte page of flash on the PIC18F4455
    #define PROGRAM_MEM_STOP_ADDRESS    0x004000 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If PROGRAM_MEM_STOP_ADDRESS = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**
    #define CONFIG_WORDS_START_ADDRESS  0x300000 //0x300000 is start of CONFIG space for these devices
    #define CONFIG_WORDS_SECTION_LENGTH 14       //14 bytes worth of Configuration words on these devices
    #define USER_ID_ADDRESS             0x200000 //User ID is 8 bytes starting at 0x200000
    #define USER_ID_SIZE                8
    #define DEVICE_WITH_EEPROM                   //Comment this out, if you never want the bootloader to reprogram the EEPROM space
    #define EEPROM_SIZE                 0x100    //256 bytes of EEPROM on this device
    #define EEPROM_EFFECTIVE_ADDRESS    0xF00000 //Location in the .hex file where the EEPROM contents are stored
    #define WRITE_BLOCK_SIZE            0x10     //16 byte programming block size on the PIC18F14K50 family devices
    #define ERASE_PAGE_SIZE             64

#elif defined(__18F13K50) || defined(__18LF13K50)
    #define MAX_PAGE_TO_ERASE           127      //Last 64 byte page of flash on the PIC18F4455
    #define PROGRAM_MEM_STOP_ADDRESS    0x002000 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If PROGRAM_MEM_STOP_ADDRESS = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**
    #define CONFIG_WORDS_START_ADDRESS  0x300000 //0x300000 is start of CONFIG space for these devices
    #define CONFIG_WORDS_SECTION_LENGTH 14       //14 bytes worth of Configuration words on these devices
    #define USER_ID_ADDRESS             0x200000 //User ID is 8 bytes starting at 0x200000
    #define USER_ID_SIZE                8
    #define DEVICE_WITH_EEPROM                   //Comment this out, if you never want the bootloader to reprogram the EEPROM space
    #define EEPROM_SIZE                 0x100    //256 bytes of EEPROM on this device
    #define EEPROM_EFFECTIVE_ADDRESS    0xF00000 //Location in the .hex file where the EEPROM contents are stored
    #define WRITE_BLOCK_SIZE            0x08     //8 byte programming block size on the PIC18F14K50 family devices
    #define ERASE_PAGE_SIZE             64

#endif


//Derived microcontroller address/page constants
#define START_PAGE_TO_ERASE             (PROGRAM_MEM_START_ADDRESS/ERASE_PAGE_SIZE)             //The first flash page number to erase, which is the start of the application program space
#define ERASE_PAGE_ADDRESS_MASK         (uint24_t)(0x1000000 - ERASE_PAGE_SIZE)                 //AND mask to move an address pointer to the start of an erase page



