esrille/new-keyboard/firmware/third_party/mla_v2013_12_20/apps/usb/device/bootloaders/firmware/pic18_non_j/src/BootPIC18NonJ.c
            }
        }
        else
        {
            TABLAT = 0xFF;
            #ifdef __XC8__
                #asm
                    tblwtpostinc
                #endasm
            #else //must be C18 instead
                _asm tblwtpostinc _endasm
            #endif
            CorrectionFactor--;
        }
    }

    //  TBLPTR--;               //Need to make table pointer point to the region which will be programmed before initiating the programming operation
    #ifdef __XC8__
        #asm
            tblrdpostdec
        #endasm
    #else //must be C18 instead
        _asm tblrdpostdec _endasm  //Do this instead of TBLPTR--; since it takes less code space.
    #endif

    EECON1 = 0b10100100;    //flash programming mode
    UnlockAndActivate(CORRECT_UNLOCK_KEY);

    //Now need to fix the ProgrammingBuffer[].  We may not have taken a full 32 bytes out of the buffer.  In this case,
    //the data is no longer justified correctly.
    for(i = 0; i < BufferedDataIndex; i++)  //Need to rejustify the remaining data to the "left" of the buffer (if there is any left)
    {
        ProgrammingBuffer[i] = ProgrammingBuffer[BytesTakenFromBuffer+i];
    }
}


void WriteConfigBits(void)  //Also used to write the Device ID
{
    static unsigned char i;

    #ifdef __XC8__
        TBLPTRU = 0x30;
        TBLPTRH = (uint8_t)((uint16_t)PacketFromPC.Address >> 8);
        TBLPTRH = (uint8_t)(PacketFromPC.Address);
    #else
        TBLPTR = (uint24_t)PacketFromPC.Address;
    #endif

    for(i = 0; i < PacketFromPC.Size; i++)
    {
        TABLAT = PacketFromPC.Data[i+(REQUEST_DATA_BLOCK_SIZE-PacketFromPC.Size)];
        #ifdef __XC8__
            #asm
                tblwt
            #endasm
        #else //must be C18 instead
            _asm tblwt _endasm
        #endif

        EECON1 = 0b11000100;    //Config bits programming mode
        UnlockAndActivate(CORRECT_UNLOCK_KEY);

        #ifdef __XC8__
            #asm
                tblrdpostinc
            #endasm
        #else //must be C18 instead
            _asm tblrdpostinc _endasm
        #endif
    }
}

#if defined(DEVICE_WITH_EEPROM)
void WriteEEPROM(void)
{
    static unsigned char i;
    
    for(i = 0; i < PacketFromPC.Size; i++)
    {
        EEADR = (((unsigned char)PacketFromPC.Address) + i);
        EEDATA = PacketFromPC.Data[i+(REQUEST_DATA_BLOCK_SIZE-PacketFromPC.Size)];

        EECON1 = 0b00000100;    //EEPROM Write mode
        UnlockAndActivate(CORRECT_UNLOCK_KEY);
    }

}
#endif

//It is preferrable to only place this sequence in only one place in the flash memory.
//This reduces the probabilty of the code getting executed inadvertently by
//errant code.  It is also recommended to enable BOR (in hardware) and/or add
//software checks to avoid microcontroller "overclocking".  Always make sure
//to obey the voltage versus frequency graph in the datasheet, even during
//momentary events (such as the power up and power down ramp of the microcontroller).
void UnlockAndActivate(unsigned char UnlockKey)
{
    INTCONbits.GIE = 0;     //Make certain interrupts disabled for unlock process.

    //Make sure voltage is sufficient for safe self erase/write operations
    LowVoltageCheck();

    //Check to make sure the caller really was trying to call this function.
    //If they were, they should always pass us the CORRECT_UNLOCK_KEY.
    if(UnlockKey != CORRECT_UNLOCK_KEY)
    {
        //Warning!  Errant code execution detected.  Somehow this 
        //UnlockAndActivate() function got called by someone that wasn't trying
        //to actually perform an NVM erase or write.  This could happen due to
        //microcontroller overclocking (or undervolting for an otherwise allowed
        //CPU frequency), or due to buggy code (ex: incorrect use of function 
        //pointers, etc.).  In either case, we should execute some fail safe 
        //code here to prevent corruption of the NVM contents.
        OSCCON = 0x03;  //Switch to INTOSC at low frequency
        while(1)
        {
            Sleep();
        }    
        Reset();
    }    
    
    #ifdef __XC8__
        EECON2 = 0x55;
        EECON2 = 0xAA;
        EECON1bits.WR = 1;
    #else
        _asm
        //Now unlock sequence to set WR (make sure interrupts are disabled before executing this)
        MOVLW 0x55
        MOVWF EECON2, 0
        MOVLW 0xAA
        MOVWF EECON2, 0
        BSF EECON1, 1, 0        //Performs write by setting WR bit
        _endasm
    #endif

    while(EECON1bits.WR);   //Wait until complete (relevant when programming EEPROM, not important when programming flash since processor stalls during flash program)  
    EECON1bits.WREN = 0;    //Good practice now to clear the WREN bit, as further protection against any accidental activation of self write/erase operations.
}   


//Note: The ClrWdt() and "_asm tblrdpostinc _endasm" are inline assembly language
//instructions.  The ClearWatchdog() and  TableReadPostIncrement() functions are 
//theoretically extraneous, since the operations being accomplished could be
//done without calling them as separate functions.  However, when using inline
//assembly language, the C18 compiler normally doesn't know what the code will
//actually do (ex: will it modify STATUS reg, WREG, BSR contents??).  As a 
//result, it is potentially dangerous for the C compiler to make assumptions,
//that might turn out not to be correct.  Therefore, the C18 compiler disables
//the compiler optimizations for a function, when one or more inline asm 
//instructions are located within the C function.  Therefore, to promote best
//code size optimizations from the C18 compiler, it is best to locate inline
//assembly sequences in their own separate C functions, that do not contain much
//other code (which could otherwise be optimized by the C compiler).  This often
//results in the smallest code size, and is the reason it is being done here.
void TableReadPostIncrement(void)
{
    #ifdef __XC8__
        #asm
            tblrdpostinc
        #endasm
    #else //must be C18 instead
        _asm tblrdpostinc _endasm
    #endif
}    

/** EOF BootPIC18NonJ.c *********************************************************/
